# encoding: utf-8
@@errors = {
	:registered => 'Ви вже зареєструвалися.',
	:logged_in => 'Ви вже увійшли.',
	:empty_input => 'Заповніть пусті поля.',
	:sign_up => 'Користувач з такими даними(логін, пошта) вже існує.',
	:login => 'Ви неправильно ввели логін або пароль.',
	:unique_email => 'Ця електронна пошта вже використовується.',
	:incorrect_email => 'Некоректний адрес електроної пошти.',
	:unique_login => 'Користувач з таким логіном вже існує.',
	:login_required => 'Будь-ласка увійдіть або зареєструйтеся.',
	:length_password => 'Занадто короткий пароль.',
	:length => 'Занадто коротке значення.',
	:sign_in_admin => 'Ви не маєте прав адміністратора.',
	:incorrect_value => 'Ви ввели некоректні дані.',
	:empty_product => 'Такого товару немає',
	:empty_group => 'Такої групи товарів немає'
}

@@notice = {
	:logout => 'Ви успішно вийшли.',
}